In [27]:
import pandas as pd

## salary 10 persent increse

In [28]:
data={
    "Name":['Ram','sam','jadu','modhu','tumpa','rani','panda','nonu'],
    "Age":[28,34,22,30,29,40,25,32],
    "salary":[5000,700000,3000,5000,20000,8000,4000,46000],
    "performance_Score":[85,90,78,92,88,95,80,89]
}

df=pd.DataFrame(data)
print(df)
df["Bonus"]=df['salary']* 0.1
print(df)

    Name  Age  salary  performance_Score
0    Ram   28    5000                 85
1    sam   34  700000                 90
2   jadu   22    3000                 78
3  modhu   30    5000                 92
4  tumpa   29   20000                 88
5   rani   40    8000                 95
6  panda   25    4000                 80
7   nonu   32   46000                 89
    Name  Age  salary  performance_Score    Bonus
0    Ram   28    5000                 85    500.0
1    sam   34  700000                 90  70000.0
2   jadu   22    3000                 78    300.0
3  modhu   30    5000                 92    500.0
4  tumpa   29   20000                 88   2000.0
5   rani   40    8000                 95    800.0
6  panda   25    4000                 80    400.0
7   nonu   32   46000                 89   4600.0

## insert method
## df.insert(loc,"Column_name",some data)

In [29]:
df.insert(0,"employee ID",[10,20,30,40,50,60,70,80])
print(df)

   employee ID   Name  Age  salary  performance_Score    Bonus
0           10    Ram   28    5000                 85    500.0
1           20    sam   34  700000                 90  70000.0
2           30   jadu   22    3000                 78    300.0
3           40  modhu   30    5000                 92    500.0
4           50  tumpa   29   20000                 88   2000.0
5           60   rani   40    8000                 95    800.0
6           70  panda   25    4000                 80    400.0
7           80   nonu   32   46000                 89   4600.0

## Updating values

In [30]:
# .loc[]
#df.loc[row_index,"column Name"]=new_value

df.loc[0,'salary']=5500
print(df)

   employee ID   Name  Age  salary  performance_Score    Bonus
0           10    Ram   28    5500                 85    500.0
1           20    sam   34  700000                 90  70000.0
2           30   jadu   22    3000                 78    300.0
3           40  modhu   30    5000                 92    500.0
4           50  tumpa   29   20000                 88   2000.0
5           60   rani   40    8000                 95    800.0
6           70  panda   25    4000                 80    400.0
7           80   nonu   32   46000                 89   4600.0

In [31]:
print(df)

   employee ID   Name  Age  salary  performance_Score    Bonus
0           10    Ram   28    5500                 85    500.0
1           20    sam   34  700000                 90  70000.0
2           30   jadu   22    3000                 78    300.0
3           40  modhu   30    5000                 92    500.0
4           50  tumpa   29   20000                 88   2000.0
5           60   rani   40    8000                 95    800.0
6           70  panda   25    4000                 80    400.0
7           80   nonu   32   46000                 89   4600.0

# updating all salary

In [32]:
df['salary']=df['salary']*1.05 ##5% increse
print(df)

   employee ID   Name  Age    salary  performance_Score    Bonus
0           10    Ram   28    5775.0                 85    500.0
1           20    sam   34  735000.0                 90  70000.0
2           30   jadu   22    3150.0                 78    300.0
3           40  modhu   30    5250.0                 92    500.0
4           50  tumpa   29   21000.0                 88   2000.0
5           60   rani   40    8400.0                 95    800.0
6           70  panda   25    4200.0                 80    400.0
7           80   nonu   32   48300.0                 89   4600.0

## removing  column

In [33]:
# df.drop(columns=["ColumnName"],inplace = True)

print("Modify data:------------------------------------")
df.drop(columns=["performance_Score"],inplace=True)

# df.drop(columns=["performance_Score","Age"],inplace=True) for multiple column

print(df)

Modify data:------------------------------------
   employee ID   Name  Age    salary    Bonus
0           10    Ram   28    5775.0    500.0
1           20    sam   34  735000.0  70000.0
2           30   jadu   22    3150.0    300.0
3           40  modhu   30    5250.0    500.0
4           50  tumpa   29   21000.0   2000.0
5           60   rani   40    8400.0    800.0
6           70  panda   25    4200.0    400.0
7           80   nonu   32   48300.0   4600.0

## missing data

NaN(not a Number)
None(for object data types)

isnull()

True==NaN is missing
False==not missing

In [34]:
data={
    "Name":['Ram','sam','jadu','modhu','tumpa','rani','panda',None],
    "Age":[28,None,22,30,None,40,None,32],
    "salary":[5000,700000,3000,5000,20000,8000,4000,46000],
    "performance_Score":[85,90,78,92,88,95,80,89]
}

df=pd.DataFrame(data)
print(df)

print(df.isnull())# where is true that is none
print(df.isnull().sum())# dind missing value all column

    Name   Age  salary  performance_Score
0    Ram  28.0    5000                 85
1    sam   NaN  700000                 90
2   jadu  22.0    3000                 78
3  modhu  30.0    5000                 92
4  tumpa   NaN   20000                 88
5   rani  40.0    8000                 95
6  panda   NaN    4000                 80
7   None  32.0   46000                 89
    Name    Age  salary  performance_Score
0  False  False   False              False
1  False   True   False              False
2  False  False   False              False
3  False  False   False              False
4  False   True   False              False
5  False  False   False              False
6  False   True   False              False
7   True  False   False              False
Name                 1
Age                  3
salary               0
performance_Score    0
dtype: int64

## Drop column and Row

In [35]:
#dropna()

data={
    "Name":['Ram','sam','jadu','modhu','tumpa','rani','panda',None],
    "Age":[28,None,22,30,None,40,None,32],
    "salary":[5000,700000,3000,5000,20000,8000,4000,46000],
    "performance_Score":[85,90,78,92,88,95,80,89]
}

df=pd.DataFrame(data)
print(df)

df.dropna(inplace=True) ##totall missing element delete
print(df)

    Name   Age  salary  performance_Score
0    Ram  28.0    5000                 85
1    sam   NaN  700000                 90
2   jadu  22.0    3000                 78
3  modhu  30.0    5000                 92
4  tumpa   NaN   20000                 88
5   rani  40.0    8000                 95
6  panda   NaN    4000                 80
7   None  32.0   46000                 89
    Name   Age  salary  performance_Score
0    Ram  28.0    5000                 85
2   jadu  22.0    3000                 78
3  modhu  30.0    5000                 92
5   rani  40.0    8000                 95

## missing element fullfill

In [36]:
#fillna()
# fillna(value,inplace=True)
data={
    "Name":['Ram','sam','jadu','modhu','tumpa','rani','panda',None],
    "Age":[28,None,22,30,None,40,None,32],
    "salary":[5000,700000,3000,5000,20000,8000,4000,46000],
    "performance_Score":[85,90,78,92,88,95,80,89]
}

df=pd.DataFrame(data)
print(df)
print("result:--------------")
# df.fillna(0,inplace=True)
print(df)

print("result2:-------------")
df['Age'].fillna(df['Age'].mean(),inplace=True)## average value in age 

print(df)

    Name   Age  salary  performance_Score
0    Ram  28.0    5000                 85
1    sam   NaN  700000                 90
2   jadu  22.0    3000                 78
3  modhu  30.0    5000                 92
4  tumpa   NaN   20000                 88
5   rani  40.0    8000                 95
6  panda   NaN    4000                 80
7   None  32.0   46000                 89
result:--------------
    Name   Age  salary  performance_Score
0    Ram  28.0    5000                 85
1    sam   NaN  700000                 90
2   jadu  22.0    3000                 78
3  modhu  30.0    5000                 92
4  tumpa   NaN   20000                 88
5   rani  40.0    8000                 95
6  panda   NaN    4000                 80
7   None  32.0   46000                 89
result2:-------------
    Name   Age  salary  performance_Score
0    Ram  28.0    5000                 85
1    sam  30.4  700000                 90
2   jadu  22.0    3000                 78
3  modhu  30.0    5000                 92
4  tumpa  30.4   20000                 88
5   rani  40.0    8000                 95
6  panda  30.4    4000                 80
7   None  32.0   46000                 89

/tmp/ipykernel_1760/353899878.py:17: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)## average value in age

## interpoation

In [37]:
data={
    "Name":['Ram','sam','jadu','modhu','tumpa','rani','panda','Nonu'],
    "Age":[28,55,22,30,34,40,24,32],
    "salary":[5000,700000,3000,5000,20000,8000,4000,46000],
    "performance_Score":[85,90,78,92,88,95,80,89]
}

df=pd.DataFrame(data)
print(df)

#linear, polynomial,time

df.interpolate(method="linear",axis=0,inplace=True)

print (df)

    Name  Age  salary  performance_Score
0    Ram   28    5000                 85
1    sam   55  700000                 90
2   jadu   22    3000                 78
3  modhu   30    5000                 92
4  tumpa   34   20000                 88
5   rani   40    8000                 95
6  panda   24    4000                 80
7   Nonu   32   46000                 89
    Name  Age  salary  performance_Score
0    Ram   28    5000                 85
1    sam   55  700000                 90
2   jadu   22    3000                 78
3  modhu   30    5000                 92
4  tumpa   34   20000                 88
5   rani   40    8000                 95
6  panda   24    4000                 80
7   Nonu   32   46000                 89

/tmp/ipykernel_1760/1327025382.py:13: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method="linear",axis=0,inplace=True)

In [38]:
data={
    "time":[1,2,3,4,5],
    "Value":[10,None,20,None,34]
}
df=pd.DataFrame(data)
print("Before interpolation")
print(df)
print("after: ")
df['Value']=df['Value'].interpolate(method="linear") ## it means =(10+20)/2 and (10+34)
print(df)

Before interpolation
   time  Value
0     1   10.0
1     2    NaN
2     3   20.0
3     4    NaN
4     5   34.0
after:
   time  Value
0     1   10.0
1     2   15.0
2     3   20.0
3     4   27.0
4     5   34.0

In [39]:
#polynomial
data={
    "time":[1,2,3,4,5],
    "Value":[10,None,20,None,34]
}
df=pd.DataFrame(data)
print("Before interpolation")
print(df)
print("after: ")
df['Value'] = df['Value'].interpolate(method='polynomial', order=2) ## y=ax^2+bx+c in this case x=2 and x=4 because value[1]=time[1] and value[3]=timr[3]
print(df)

Before interpolation
   time  Value
0     1   10.0
1     2    NaN
2     3   20.0
3     4    NaN
4     5   34.0
after:
   time  Value
0     1   10.0
1     2   14.5
2     3   20.0
3     4   26.5
4     5   34.0

In [40]:
#time
df['time'] = pd.to_datetime(df['time'], unit='D')  #(unit='D' means "treat these numbers as days since 1970-01-01")
df.set_index('time', inplace=True)#Now time becomes the row label (index).
df['Value'] = df['Value'].interpolate(method='time')#

print(df)

            Value
time
1970-01-02   10.0
1970-01-03   14.5
1970-01-04   20.0
1970-01-05   26.5
1970-01-06   34.0

## Sorting && Agrigation

In [41]:
#sorting data
#sorting data 1 column sort_values()
#def.sort_values(by="column Name",True/False,inplace=True)
data={
    "Name":['Ram','sam','jadu'],
    "Age":[28,55,22],
    "salary":[5000,700000,3000],
}
print("before--------")
df=pd.DataFrame(data)
print(df)
print("After-------")

df.sort_values(by="Age", ascending=False,inplace=True) # high->low
df.sort_values(by="Age", ascending=True,inplace=True) # low->high
print(df)

before--------
   Name  Age  salary
0   Ram   28    5000
1   sam   55  700000
2  jadu   22    3000
After-------
   Name  Age  salary
2  jadu   22    3000
0   Ram   28    5000
1   sam   55  700000

In [42]:
#df.sort_values(by=["Age","salary"], ascending=True,inplace=True)
data={
    "Name":['Ram','sam','jadu'],
    "Age":[28,55,22],
    "salary":[5000,7000,3000],
}
print("before--------")
df=pd.DataFrame(data)
print(df)
print("After-------")

df.sort_values(by=["Age", "salary"], ascending=[True, False], inplace=True)
print(df)

before--------
   Name  Age  salary
0   Ram   28    5000
1   sam   55    7000
2  jadu   22    3000
After-------
   Name  Age  salary
2  jadu   22    3000
0   Ram   28    5000
1   sam   55    7000

# avg salary

In [43]:
avg_salary=df['salary'].mean()
print(avg_salary)

5000.0

## grouping

In [44]:
data={
    "Name":['Ram','sam','jadu'],
    "Age":[28,55,22],
    "salary":[5000,7000,3000],
}
print("before--------")
df=pd.DataFrame(data)
print(df)
print("After-------")
group = df.groupby("Age")["salary"].sum()
print(group)

before--------
   Name  Age  salary
0   Ram   28    5000
1   sam   55    7000
2  jadu   22    3000
After-------
Age
22    3000
28    5000
55    7000
Name: salary, dtype: int64

In [45]:
#grouping in pandas

class_10_students = {
    "Name":["Tanmay","Tanu","kallyan","Subho","Bapan","Deba"],
    "Sec" :["A","B","A","C","B","A"],
    "Age" :[19,17,18,19,18,17]
}
df_class_10_students = pd.DataFrame(class_10_students)
print(df_class_10_students)

#group based on sec and find the min age 
group_by_sec = df_class_10_students.groupby("Sec") ["Age"].min()
print(group_by_sec)
#print(type(group_by_sec))
#print(group_by_sec["A"])


#group by multiple column

#pass as a list form groupby(["col1","col2"]).aggregation()..

      Name Sec  Age
0   Tanmay   A   19
1     Tanu   B   17
2  kallyan   A   18
3    Subho   C   19
4    Bapan   B   18
5     Deba   A   17
Sec
A    17
B    17
C    19
Name: Age, dtype: int64

## Multiple value control

In [46]:
data={
    "Name":['Ram','sam','jadu','jadu'],
    "Age":[28,55,22,34],
    "salary":[5000,7000,3000,4000],
}
print("before--------")
df=pd.DataFrame(data)
print(df)
print("After-------")
group = df.groupby(["Age","Name"])["salary"].sum()
print(group)

before--------
   Name  Age  salary
0   Ram   28    5000
1   sam   55    7000
2  jadu   22    3000
3  jadu   34    4000
After-------
Age  Name
22   jadu    3000
28   Ram     5000
34   jadu    4000
55   sam     7000
Name: salary, dtype: int64

## common.txt

1->sum()

2->mean()

3->count()

4->min()

5->max()

6->std()

## Marging and Joining

In [47]:
#pd.merge(df1,df2, on="column_name",how="type of join")

## coustomer dataframe

df_customer=pd.DataFrame({

    'customer_Id':[1,2,3],
    'Name':['Ramesh','Suresh','Kalpesh']

})

#order dataframe

df_order=pd.DataFrame({
    'customer_Id':[1,2,4],  # Changed 'customer_idz' to 'customer_Id' to match df_customer
    'order_amount':[250,450,350]
})

##merge
df_merged=pd.merge(df_customer,df_order, on="customer_Id",how="inner")

print("inner join")
print(df_merged)

inner join
   customer_Id    Name  order_amount
0            1  Ramesh           250
1            2  Suresh           450

## outer join

In [48]:
#pd.merge(df1,df2, on="column_name",how="type of join")

## coustomer dataframe

df_customer=pd.DataFrame({

    'customer_Id':[1,2,3],
    'Name':['Ramesh','Suresh','Kalpesh']

})

#order dataframe

df_order=pd.DataFrame({
    'customer_Id':[1,2,4],  # Changed 'customer_idz' to 'customer_Id' to match df_customer
    'order_amount':[250,450,350]
})

##merge
df_merged=pd.merge(df_customer,df_order, on="customer_Id",how="outer")

print("outer join")
print(df_merged)

outer join
   customer_Id     Name  order_amount
0            1   Ramesh         250.0
1            2   Suresh         450.0
2            3  Kalpesh           NaN
3            4      NaN         350.0

## left join

In [49]:
#pd.merge(df1,df2, on="column_name",how="type of join")

## coustomer dataframe

df_customer=pd.DataFrame({

    'customer_Id':[1,2,3],
    'Name':['Ramesh','Suresh','Kalpesh']

})

#order dataframe

df_order=pd.DataFrame({
    'customer_Id':[1,2,4],  # Changed 'customer_idz' to 'customer_Id' to match df_customer
    'order_amount':[250,450,350]
})

##merge
df_merged=pd.merge(df_customer,df_order, on="customer_Id",how="left")

print("left join")
print(df_merged)

left join
   customer_Id     Name  order_amount
0            1   Ramesh         250.0
1            2   Suresh         450.0
2            3  Kalpesh           NaN

## right join

In [50]:
#pd.merge(df1,df2, on="column_name",how="type of join")

## coustomer dataframe

df_customer=pd.DataFrame({

    'customer_Id':[1,2,3],
    'Name':['Ramesh','Suresh','Kalpesh']

})

#order dataframe

df_order=pd.DataFrame({
    'customer_Id':[1,2,4],  # Changed 'customer_idz' to 'customer_Id' to match df_customer
    'order_amount':[250,450,350]
})

##merge
df_merged=pd.merge(df_customer,df_order, on="customer_Id",how="right")

print("right join")
print(df_merged)

right join
   customer_Id    Name  order_amount
0            1  Ramesh           250
1            2  Suresh           450
2            4     NaN           350

## concatination vertically

In [51]:
#resone1

df_region1=pd.DataFrame({

    'customer_id':[1,2],
    'Name':['Gopal','Raju']

})
#reson2
df_region2=pd.DataFrame({
    'customer_id':[3,4],
    'Name':['shyam','jaadu']

})

##concatination vertically
df_concat=pd.concat([df_region1,df_region2],ignore_index=True)

print(df_concat)

   customer_id   Name
0            1  Gopal
1            2   Raju
2            3  shyam
3            4  jaadu

## concatination horigentaly

In [52]:
#resone1

df_region1=pd.DataFrame({

    'customer_id':[1,2],
    'Name':['Gopal','Raju']

})
#reson2
df_region2=pd.DataFrame({
    'customer_id':[3,4],
    'Name':['shyam','jaadu']

})

##concatination vertically
df_concat=pd.concat([df_region1,df_region2],axis=1,ignore_index=True)

print(df_concat)

   0      1  2      3
0  1  Gopal  3  shyam
1  2   Raju  4  jaadu